In [ ]:
import pandas as pd

# Step 0: Create the Data

In [8]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "Diana", "Ethan"],
    "StudyHours": [10, 6, 14, 9, 12],
    "SleepHours": [7, 5, 8, 6, 7],
    "Attendance": [90, 75, 95, 80, 88],
    "FinalScore": [85, 70, 92, 78, 88]
}

students = pd.DataFrame(data)

# Step 1: Understand the Data (info & describe)

In [9]:
students.head()

      Name  StudyHours  SleepHours  Attendance  FinalScore
0    Alice          10           7          90          85
1      Bob           6           5          75          70
2  Charlie          14           8          95          92
3    Diana           9           6          80          78
4    Ethan          12           7          88          88

In [10]:
students.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        5 non-null      object
 1   StudyHours  5 non-null      int64
 2   SleepHours  5 non-null      int64
 3   Attendance  5 non-null      int64
 4   FinalScore  5 non-null      int64
dtypes: int64(4), object(1)
memory usage: 332.0+ bytes

In [11]:
students.describe()

       StudyHours  SleepHours  Attendance  FinalScore
count     5.00000    5.000000    5.000000     5.00000
mean     10.20000    6.600000   85.600000    82.60000
std       3.03315    1.140175    8.018728     8.70632
min       6.00000    5.000000   75.000000    70.00000
25%       9.00000    6.000000   80.000000    78.00000
50%      10.00000    7.000000   88.000000    85.00000
75%      12.00000    7.000000   90.000000    88.00000
max      14.00000    8.000000   95.000000    92.00000

# Step 2: Indexing & Data Selection

In [13]:
students.set_index("Name", inplace=True)
students

         StudyHours  SleepHours  Attendance  FinalScore
Name
Alice            10           7          90          85
Bob               6           5          75          70
Charlie          14           8          95          92
Diana             9           6          80          78
Ethan            12           7          88          88

In [15]:
students.loc['Charlie']

StudyHours    14
SleepHours     8
Attendance    95
FinalScore    92
Name: Charlie, dtype: int64

In [17]:
students[['StudyHours', 'FinalScore']]

         StudyHours  FinalScore
Name
Alice            10          85
Bob               6          70
Charlie          14          92
Diana             9          78
Ethan            12          88

In [20]:
students['FinalScore'].idxmax()

'Charlie'

# Step 3: Basic Operations

In [21]:
students['TotalEffort'] = students['StudyHours'] + students['SleepHours']
students

         StudyHours  SleepHours  Attendance  FinalScore  TotalEffort
Name
Alice            10           7          90          85           17
Bob               6           5          75          70           11
Charlie          14           8          95          92           22
Diana             9           6          80          78           15
Ethan            12           7          88          88           19

In [23]:
students['PerformanceLevel'] = students['FinalScore'].apply(
    lambda x: 'High' if x >= 85 else 'Medium' if 75 <= x < 85 else 'Low')
students

,StudyHours,SleepHours,Attendance,FinalScore,TotalEffort,PerformanceLevel
Name,,,,,,
Alice,10,7,90,85,17,High
Bob,6,5,75,70,11,Low
Charlie,14,8,95,92,22,High
Diana,9,6,80,78,15,Medium
Ethan,12,7,88,88,19,High

# Step 4: Data Filtering & Insights

In [28]:
students[(students['StudyHours'] >= 8) & (students['Attendance'] >= 85)]

,StudyHours,SleepHours,Attendance,FinalScore,TotalEffort,PerformanceLevel
Name,,,,,,
Alice,10,7,90,85,17,High
Charlie,14,8,95,92,22,High
Ethan,12,7,88,88,19,High

In [29]:
ave = students['FinalScore'].mean()
print(f'Average score: {ave:.2f}')

Average score: 82.60

In [33]:
students.sort_values(by='FinalScore', ascending=False, inplace=True)
students

,StudyHours,SleepHours,Attendance,FinalScore,TotalEffort,PerformanceLevel
Name,,,,,,
Charlie,14,8,95,92,22,High
Ethan,12,7,88,88,19,High
Alice,10,7,90,85,17,High
Diana,9,6,80,78,15,Medium
Bob,6,5,75,70,11,Low